brew "openssl@3"
brew "readline"
brew "coreutils"
brew "direnv"
brew "gh"
brew "sqlite"
brew "tcl-tk"
brew "tree"
brew "xz"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-syntax-highlighting"
brew "awscli"
brew "aws-sam-cli"
brew "git-secrets"
brew "jq"
brew "yq"
# brew "mysql" # 9.x がインストールされてしまう
brew "mysql@8.0" # パスを.zshrc で設定する必要がある
brew "mise"
brew "mas"
brew "hadolint"
brew "blueutil"
brew "uv"
brew "supabase/tap/supabase"
brew "libpq"
brew "redis"
brew "glab"
brew "cocoapods"
brew "peco"
