cask_args appdir: "/Applications"

brew "openssl@3"
brew "readline"
brew "curl"
brew "git"
brew "coreutils"
brew "direnv"
brew "gh"
brew "sqlite"
brew "tcl-tk"
brew "tree"
brew "xz"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-syntax-highlighting"
brew "awscli"
brew "aws-sam-cli"
brew "jq"
brew "volta"
brew "mysql"
brew "mise"
brew "mas"

# Desktop Apps

cask "visual-studio-code"
# cask "google-chrome"
cask "arc"
cask "iterm2"
cask "docker"
cask "postman"
cask "slack"
cask "discord"
cask "zoom"
cask "clipy"
cask "chatgpt"

brew "mas"
mas "Xcode", id: 497799835
mas "LINE", id: 539883307
