cask_args appdir: "/Applications"

brew "openssl@3"
brew "readline"
brew "coreutils"
brew "direnv"
brew "gh"
brew "sqlite"
brew "tcl-tk"
brew "tree"
brew "xz"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-syntax-highlighting"
brew "awscli"
brew "aws-sam-cli"
brew "jq"
brew "yq"
brew "volta"
# brew "mysql" # 9.x がインストールされてしまう
brew "mysql@8.0" # パスを.zshrc で設定する必要がある
brew "mise"
brew "mas"
brew "hadolint"
brew "blueutil"
brew "uv"
brew "supabase/tap/supabase"

# Desktop Apps

cask "visual-studio-code"
cask "google-chrome"
cask "arc"
cask "iterm2"
cask "docker"
cask "postman"
cask "slack"
cask "discord"
cask "clipy"
cask "mysqlworkbench"
cask "deepl"

mas "Xcode", id: 497799835
mas "LINE", id: 539883307
